Projects/First_Benchmark/output/sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Tables KUNDENMITVARCHAR and BESTELLUNGMITVARCHAR have been successfully created.
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 4 tps: 0.00 qps: 15894.97 (r/w/o: 0.00/3973.74/11921.22) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 4 tps: 0.00 qps: 15350.72 (r/w/o: 0.00/3837.68/11513.04) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 4 tps: 0.00 qps: 16999.29 (r/w/o: 0.00/4249.82/12749.46) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 4 tps: 0.00 qps: 17554.47 (r/w/o: 0.00/4388.62/13165.85) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 4 tps: 0.00 qps: 17359.29 (r/w/o: 0.00/4339.57/13019.71) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 4 tps: 0.00 qps: 17300.22 (r/w/o: 0.00/4325.31/12974.92) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 4 tps: 0.00 qps: 19033.39 (r/w/o: 0.00/4758.35/14275.04) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 4 tps: 0.00 qps: 19511.41 (r/w/o: 0.00/4877.85/14633.56) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 4 tps: 0.00 qps: 19895.21 (r/w/o: 0.00/4973.80/14921.41) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 4.00 qps: 18031.71 (r/w/o: 4.00/3396.96/14630.74) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 4 tps: 0.00 qps: 22114.25 (r/w/o: 0.00/4150.67/17963.58) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 4 tps: 0.00 qps: 22879.18 (r/w/o: 0.00/4292.84/18586.34) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 4 tps: 0.00 qps: 22544.02 (r/w/o: 0.00/4245.99/18298.03) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 4 tps: 0.00 qps: 22279.77 (r/w/o: 0.00/4168.95/18110.82) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 0.00 qps: 20801.31 (r/w/o: 0.00/3897.25/16904.06) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 4 tps: 0.00 qps: 20281.61 (r/w/o: 0.00/3804.55/16477.06) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 4 tps: 4.00 qps: 14401.93 (r/w/o: 4.00/2693.11/11704.82) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 4 tps: 0.00 qps: 20340.29 (r/w/o: 0.00/3810.80/16529.49) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 4 tps: 0.00 qps: 20236.21 (r/w/o: 0.00/3788.30/16447.91) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 0.00 qps: 21409.66 (r/w/o: 0.00/3986.59/17423.07) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 4 tps: 0.00 qps: 22747.89 (r/w/o: 0.00/4274.54/18473.35) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 4 tps: 0.00 qps: 22940.78 (r/w/o: 0.00/4288.77/18652.01) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 4 tps: 0.00 qps: 22484.22 (r/w/o: 0.00/4233.03/18251.19) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 4 tps: 0.00 qps: 22138.44 (r/w/o: 0.00/4140.46/17997.98) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 4.00 qps: 14037.53 (r/w/o: 4.00/2643.29/11390.24) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 4 tps: 0.00 qps: 22952.99 (r/w/o: 0.00/4300.43/18652.56) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 4 tps: 0.00 qps: 23235.56 (r/w/o: 0.00/4349.68/18885.88) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 4 tps: 0.00 qps: 22116.13 (r/w/o: 0.00/4144.52/17971.61) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 4 tps: 0.00 qps: 23093.23 (r/w/o: 0.00/4314.48/18778.75) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 0.00 qps: 22801.04 (r/w/o: 0.00/4274.88/18526.16) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 4 tps: 0.00 qps: 22852.29 (r/w/o: 0.00/4309.15/18543.14) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 4 tps: 0.00 qps: 13437.40 (r/w/o: 0.00/2529.46/10907.94) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 4 tps: 4.02 qps: 17747.97 (r/w/o: 4.02/3309.91/14434.04) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 4 tps: 0.00 qps: 22338.88 (r/w/o: 0.00/4184.04/18154.84) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 0.00 qps: 22911.93 (r/w/o: 0.00/4299.99/18611.94) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 4 tps: 0.00 qps: 22728.48 (r/w/o: 0.00/4279.08/18449.40) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 4 tps: 0.00 qps: 19226.03 (r/w/o: 0.00/3599.82/15626.22) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 4 tps: 0.00 qps: 21070.34 (r/w/o: 0.00/3956.50/17113.83) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 4 tps: 0.00 qps: 22548.42 (r/w/o: 0.00/4237.58/18310.85) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 0.00 qps: 11788.51 (r/w/o: 0.00/2221.04/9567.47) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 4 tps: 4.01 qps: 17327.22 (r/w/o: 4.01/3225.32/14097.89) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 4 tps: 0.00 qps: 20438.70 (r/w/o: 0.00/3837.02/16601.68) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 4 tps: 0.00 qps: 20004.78 (r/w/o: 0.00/3765.41/16239.38) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 4 tps: 0.00 qps: 20208.64 (r/w/o: 0.00/3803.86/16404.78) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 0.00 qps: 20553.67 (r/w/o: 0.00/3826.70/16726.96) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 4 tps: 0.00 qps: 20514.95 (r/w/o: 0.00/3843.17/16671.77) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 4 tps: 0.00 qps: 20578.27 (r/w/o: 0.00/3843.68/16734.59) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 4 tps: 0.00 qps: 19965.08 (r/w/o: 0.00/3749.92/16215.16) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 4 tps: 4.01 qps: 5999.76 (r/w/o: 4.01/1119.94/4875.81) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 0.00 qps: 22785.56 (r/w/o: 0.00/4262.78/18522.79) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 4 tps: 0.00 qps: 22040.46 (r/w/o: 0.00/4151.09/17889.38) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 4 tps: 0.00 qps: 22737.85 (r/w/o: 0.00/4277.21/18460.64) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 4 tps: 0.00 qps: 22379.82 (r/w/o: 0.00/4201.10/18178.72) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 4 tps: 0.00 qps: 22723.54 (r/w/o: 0.00/4271.42/18452.13) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 0.00 qps: 22587.26 (r/w/o: 0.00/4252.10/18335.17) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 4 tps: 0.00 qps: 19802.53 (r/w/o: 0.00/3727.42/16075.11) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 4 tps: 4.00 qps: 2248.04 (r/w/o: 4.00/418.01/1826.03) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 4 tps: 0.00 qps: 22811.53 (r/w/o: 0.00/4266.87/18544.67) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 4 tps: 0.00 qps: 22907.16 (r/w/o: 0.00/4290.66/18616.50) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 0.00 qps: 21999.17 (r/w/o: 0.00/4121.78/17877.39) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 4 tps: 0.00 qps: 22626.73 (r/w/o: 0.00/4225.76/18400.97) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 4 tps: 0.00 qps: 22680.21 (r/w/o: 0.00/4239.53/18440.68) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 4 tps: 0.00 qps: 22214.18 (r/w/o: 0.00/4165.66/18048.52) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 4 tps: 0.00 qps: 21648.05 (r/w/o: 0.00/4053.29/17594.76) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 4 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            32
        write:                           249805
        other:                           1029435
        total:                           1279272
    transactions:                        32     (0.49 per sec.)
    queries:                             1279272 (19630.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          65.1663s
    total number of events:              32

Latency (ms):
         min:                                 7590.88
         avg:                                 8141.87
         max:                                 9170.44
         95th percentile:                        0.00
         sum:                               260539.70

Threads fairness:
    events (avg/stddev):           8.0000/0.00
    execution time (avg/stddev):   65.1349/0.02

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Cleanup sucessfully done